function get_value_position(e){
    console.log(e);
    var el = document.getElementsByClassName("block-point-service");
    var el1 = document.getElementsByClassName('dropdown');
    var el2 = document.getElementsByClassName('icon-menu menu-reclama');
    var el3 = document.getElementsByClassName('green');


   
    if (e === 'Отчистить'){
        el[0].innerText = '';
        

    }else{
        el[0].innerText = '';
        el[0].innerText = e;
    }

    
    el1[0].style.display = 'none';
    el2[0].style.display = 'block';
    el3[0].style.display = 'none';
    
}
function catch_simbol_region_reclama(event){
    console.log(event);
    var el = document.getElementById('state'); // получем символ
    console.log(el);

    find_state(event.key,el.value);
}
        


function find_state(el,value){
    
    var states = ['Aдыгея', 'Башкортостан', 'Бурятия', 'Алтай', 'Дагестан', 'Ингушетия', 'Кабардино-Балкария',
    'Калмыкия', 'Карачаево-Черкессия', 'Карелия', 'Коми', 'Марий Эл', 'Мордовия', 'Саха',
    'Северная Осетия', 'Татарстан', 'Тыва', 'Удмуртия', 'Хакасия', 'Чечня', 'Чувашия', 'Алтайский край', 'Краснодарский край', 'Красноярский край',
    'Приморский край', 'Ставропольский край',
    'Хабаровский край', 'Амурская область', 'Архангельская область', 'Астраханская область', 'Белгородская область', 'Брянская область',
    'Владимирская область', 'Волгоградская область',
    'Вологодская область', 'Воронежская область','Ивановская область', 'Иркутская область', 'Калининградская область', 'Калужская область', 
    'Камчатский край',
    'Кемеровская область', 'Кировская область', 'Костромская область', 'Курганская область', 'Курская область', 'Ленинградская область',
    'Липецкая область', 'Магаданская область', 'Московская область', 'Мурманская область', 'Нижегородская область', 'Новгородская область',
    'Камчатский край',
    'Новосибирская область', 'Омская область', 'Оренбургская область', 'Орловская область', 'Пензенская область', 'Пермский край', 'Псковская область',
    'Ростовская область', 'Рязанская область', 'Самарская область', 'Саратовская область', 'Сахалинская область', 'Свердловская область', 'Смоленская область',
    'Тамбовская область', 'Тверская область', 'Томская область', 'Тульская область', 'Тюменская область', 'Ульяновская область', 'Челябинская область',
    'Забайкальский край', 'Ярославская область', 'Москва', 'Санкт-Петербург', 'Еврейская автономная область', 'Ненецкий автономный округ', 
    'Ханты-Мансийский автономный округ', 'Чукотский автономный округ', 'Ямало-Ненецкий автономный округ', 'Крым', 'Севастополь'];


    states.forEach(function(item, i, states) {

        if (item.includes(value) == true){
            var el1 = document.getElementById('coincidence_state1'); //где выводим
            el1.innerHTML = item;
            console.log(item);
    
        }

    });

   
}
function agree(){
    var el = document.getElementById('coincidence_state1');
    var el1 = document.getElementById('state');
    el1.value = el.textContent
    console.log(el1.value);
}
